tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/constant/sourcesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource1
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0.2;
    duration        2.0;
    selectionMode   points;
    points
    (
        (2.75 0.5 0)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            rho         1e-4; // kg/s
            H2O         1e-4; // kg/s
        }
    }
}


momentumSource1
{
    type            vectorExplicitSource;
    active          true;
    timeStart       0.2;
    duration        2.0;
    selectionMode   points;
    points
    (
        (2.75 0.5 0)
    );

    vectorExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            U           (0 0.005 0);
        }
    }
}


energySource1
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0.2;
    duration        2.0;
    selectionMode   points;
    points
    (
        (2.75 0.5 0)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            hs          10;
        }
    }
}


// ************************************************************************* //
